---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.WorksetJoinWarn
source: html/75b9e44c-cea1-6726-adc5-cd9880261c39.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.WorksetJoinWarn Property

Two elements were not automatically joined because one or both is not editable.

## Syntax (C#)
```csharp
public static FailureDefinitionId WorksetJoinWarn { get; }
```